<?php

namespace App\Service;

class Slugify
{
    public const REMOVE_ACCENT = [
        "A" => ['À', 'Á', 'Â', 'Ã', 'Ä', 'Å', 'Ā', 'Ă', 'Ą', 'Ǎ', 'Ǻ',],
        "AE" => ['Æ', 'Ǽ',],
        "C" => ['Ç', 'Ć', 'Ĉ', 'Ċ', 'Č',],
        "E" => ['È', 'É', 'Ê', 'Ë', 'Ē', 'Ĕ', 'Ė', 'Ę', 'Ě',],
        "F" => ['ſ',],
        "G" => ['Ĝ', 'Ğ', 'Ġ', 'Ģ',],
        "H" => ['Ĥ', 'Ħ',],
        "I" => ['Ì', 'Í', 'Î', 'Ï', 'Ĩ', 'Ī', 'Ĭ', 'Į', 'İ', 'Ǐ',],
        "IJ" => ['Ĳ',],
        "J" => ['Ĵ',],
        "K" => ['Ķ',],
        "L" => ['Ĺ', 'Ļ', 'Ľ', 'Ŀ', 'Ł',],
        "D" => ['Ð', 'Ď', 'Đ',],
        "N" => ['Ñ', 'Ń', 'Ņ', 'Ň',],
        "O" => ['Ò', 'Ó', 'Ô', 'Õ', 'Ö', 'Ø', 'Ō', 'Ŏ', 'Ő', 'Ǿ', 'Ơ', 'Ǒ',],
        'OE' => ['Œ',],
        'R' => ['Ŕ', 'Ŗ', 'Ř',],
        'S' => ['Ś', 'Ŝ', 'Ş', 'Š',],
        'T' => ['Ţ', 'Ť', 'Ŧ',],
        "U" => ['Ù', 'Ú', 'Û', 'Ü', 'Ũ', 'Ū', 'Ŭ', 'Ů', 'Ű', 'Ų', 'Ư', 'Ǔ', 'Ǖ', 'Ǘ', 'Ǚ', 'Ǜ',],
        "W" => ['Ŵ',],
        "Y" => ['Ý', 'Ŷ', 'Ÿ',],
        "Z" => ['Ź', 'Ż', 'Ž',],
        "SS" => ['ß'],
        "a" => ['à', 'á', 'â', 'ã', 'ä', 'å', 'ā', 'ă', 'ą', 'ǎ', 'ǻ',],
        "ae" => ['æ', 'ǽ',],
        "c" => ['ç', 'ć', 'ĉ', 'ċ', 'č',],
        "d" => ['ď', 'đ',],
        'e' => ['è', 'é', 'ê', 'ë', 'ē', 'ĕ', 'ė', 'ę', 'ě',],
        'f' => ['ƒ',],
        'g' => ['ĝ', 'ğ', 'ġ', 'ģ',],
        'h' => ['ĥ', 'ħ',],
        'i' => ['ì', 'í', 'î', 'ï', 'ĩ', 'ī', 'ĭ', 'į', 'ı', 'ǐ',],
        'ij' => ['ĳ',],
        'j' => ['ĵ',],
        'k' => ['ķ',],
        'l' => ['ĺ',  'ļ', 'ľ', 'ŀ', 'ł',],
        'n' => ['ñ', 'ń', 'ņ', 'ň', 'ŉ',],
        'o' => ['ò', 'ó', 'ô', 'õ', 'ö', 'ø', 'ō', 'ŏ', 'ő', 'ǿ', 'ơ', 'ǒ',],
        'oe' => ['œ',],
        'r' => ['ŕ', 'ŗ', 'ř',],
        's' => ['ś', 'ŝ', 'ş', 'š',],
        't' => ['ţ', 'ť', 'ŧ',],
        'u' => ['ù', 'ú', 'û', 'ü', 'ũ', 'ū', 'ŭ', 'ů', 'ű', 'ų', 'ư', 'ǔ', 'ǖ', 'ǘ', 'ǚ', 'ǜ',],
        'w' => ['ŵ',],
        'y' => ['ý', 'ÿ', 'ŷ',],
        'z' => ['ź', 'ż', 'ž',]
    ];

    public function removeAccent(string $str): string
    {
        for ($i = 0; $i <= strlen($str) - 1; $i++) {
            foreach (self::REMOVE_ACCENT as $key => $value) {
                if (in_array($str[$i] . $str[$i + 1], $value)) {
                    $str = str_replace($str[$i] . $str[$i + 1], $key, $str);
                }
            }
        }
        return $str;
    }
    public function generate(string $str): string
    {
        $cleanUrl = (string) preg_replace(
            array('/[^a-zA-Z0-9 \' -]/', '/[ -]+/', '/^-|-$/'),
            array('', '-', ''),
            $this->removeAccent($str)
        );
        return strtolower($cleanUrl);
    }
}
